# Series
ðŸŽ¯A one-dimensional array-like object containing a sequnce of values and associated array of data labels, called its index

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# Get the array representation and index object of the Series
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# Customize labels - index parameter
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
# Use labels in the indexing to get the single value or set of values
print(obj2['a'])

-5

In [8]:
print(obj2['d'])

4

In [9]:
print(obj2[['c','a','d']])

c    3
a   -5
d    4
dtype: int64

In [10]:
# Filtering with a boolean array
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [11]:
# Scalar multiplication
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
# Mapping of indexing values to data values
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
# Convert Python dicttionary to Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# Ovveride the dict keys in the order we want then to appear
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata, index = states)

In [19]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
# Missing or NA values detect
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
# Or
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
# Or
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
""" A useful Series feature for many applications is that it automatically
aligns by index label in arithmetic operations."""

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
# Both the Series object itself and its index have a name attribute

obj4.name = 'population'

In [28]:
obj4.index.name = 'state'

In [29]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [30]:
obj4.name

'population'

In [31]:
obj4.index.name

'state'

# DataFrame
ðŸŽ¯ðŸŽ¯A DataFrame represents a rectangular table of data and contains an ordered colection of columns, each of which can be a diiferent value type. It has both row and column index

In [32]:
# Construct a DataFrame from a dict of equal-length lists or NumPy arrays (common)
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop': [1.5, 1.7,3.6,2.4,2.9,3.2]
       }

frame = pd.DataFrame(data)

In [33]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
# For learge DataFrames, the head() method selects only the first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [35]:
# We can pass how many rows we want as parameters
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [36]:
# For learge DataFrames, the tail() method selects only the last five rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
# We can pass how many rows we want as parameters
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
# Manage sequence of columns according to custom order - using columns parameter
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [39]:
# If we pass a column that isn't contained in the dict, it will appear with missing values
frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'], index = ['one','two','three','four','five','six'])

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [41]:
# Columns in the DataFrame
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
# Shape of the DataFrame
frame2.shape

(6, 4)

In [43]:
# Information about the DataFrame
frame2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6 non-null      int64
 1   state   6 non-null      object
 2   pop     6 non-null      float64
 3   debt    0 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 240.0+ bytes

In [44]:
# Statistical summary
frame2.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [45]:
# Retrieved a column as a series - dict-like notation
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [46]:
# Accessing like object atribute
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [47]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [48]:
# Columns can be modified by assignment
frame2['debt'] = 16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [50]:
""" When assigning lists or assarys to a column, the values length must match the length of the DataFrame."""
frame2['debt'] = np.arange(6.)

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [52]:
# Assign valus to specific rows - using Series
values = pd.Series([-1.2,-1.5,-1.7], index = ['two','four','five'])

In [53]:
# If you assign a Series, its labels will be realigned exactly to the DataFrame's index. Inserting missing values in any holes
frame2['debt'] = values

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [55]:
# Creatin a new column
frame2['eastern'] = frame2.state == 'Ohio'

In [56]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [57]:
# Delete method can be used to remove column
del frame2['eastern']

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [59]:
# DataFrame from dict of dicts
pop = {'Nevada':{2001:2.4, 2002:2.9}, 'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [60]:
# If the nested dict is passed to the DataFrame, pandas will interpret the outer dict kes as the columns and the inner keys as the row indices
frame3 = pd.DataFrame(pop)

In [61]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
# DataFrame can be transposed like NumPy array
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [63]:
pd.DataFrame(pop, index = [2000, 2001, 2002, 2003])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [64]:
frame3.index

Index([2001, 2002, 2000], dtype='int64')

In [65]:
frame3.values
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [66]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [67]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [68]:
# Set the DataFrame name, column name, and index name
frame3.name = 'population'
frame3.index.name = 'yaer'
frame3.columns.name = 'state'

In [69]:
frame3.name

'population'

In [70]:
frame3.index.name

'yaer'

In [71]:
frame3.columns.name

'state'

In [72]:
frame3

state  Nevada  Ohio
yaer
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [73]:
# As with Series, the values attribute returns the data conatined in the DataFrame as a two-dimensional ndarray
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [75]:
# If the DataFrame's columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the the columns
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# Index Objects
ðŸŽ¯Pandas's Index objects are responsible for holding the labels and other metadeta (like the axis name or names)

In [83]:
obj = pd.Series(range(3), index = ['a','b','c'])

In [84]:
index = obj.index

In [87]:
index

Index(['a', 'b', 'c'], dtype='object')

In [89]:
index[1:]

Index(['b', 'c'], dtype='object')

In [91]:
# Index objects are immutable and thus can not be modified by the user
index[1] = 'd'

TypeError: Index does not support mutable operations

In [93]:
# Immutability makes it safer to share Index objects among data structure
labels = pd.Index(np.arange(3))

In [95]:
labels

Index([0, 1, 2], dtype='int64')

In [97]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [99]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [102]:
obj2.index is labels

True

In [104]:
idx = pd.Index(['a','b','c'])

In [106]:
s1 = pd.Series([1,2,3], index = idx)

In [108]:
s2 = pd.Series([4,5,6], index = idx)

In [110]:
# Both s1 and s share the same index object
s1.index is s2.index

True

In [112]:
# An Index also behaves like a fixed-size set
frame3

state  Nevada  Ohio
yaer
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [114]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [117]:
# Check if a column exists in the columns
'Nevada' in frame3.columns

True

In [119]:
# Check if an index exists in the row labels/indices
2003 in frame3.index

False

In [121]:
# Unlike Python sets, a pandas Index can contain duplicate labels
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [123]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [125]:
# Selection with duplicate labels will select all the occurrence of that label
s = pd.Series([1,2,3,4], index = dup_labels)

In [128]:
s.loc['foo']

foo    1
foo    2
dtype: int64

# Essential Functionality

### Reindexing
ðŸŽ¯An important method on pandas objects is reindex, which means to create a new object with the data confirmed to a new index

In [129]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b','a', 'c'])

In [131]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [138]:
# Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any values were not already present
obj2 = obj.reindex(['a','b','c','d','e'])

In [139]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [151]:
# We can use the method parameter to fill the missing values automatically
obj3 = pd.Series(['blue','purple','yellow'], index = [0,2,4])

In [152]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [153]:
# method parameter can only be used when the index is ordered - meaning the index must have a clear order so Pandas knows what 'forward/backward' means
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [157]:
obj3.reindex(range(5), method = 'bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
dtype: object

In [162]:
# With DataFrame, reindex can alter the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result
frame = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'], columns = ['Ohio','Texas','California'])

In [163]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [169]:
frame2 = frame.reindex(['a','b','c','d'])

In [171]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [173]:
# The columns can be reindexed with the columns keyword
states = ['Texas', 'Utah', 'California']

In [175]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### Dropping Entries from an Axis
ðŸŽ¯The drop method is used to drop entries. It will return a new object with theindicated value or values deleted from an axis

In [179]:
obj = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])

In [181]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [183]:
new_obj = obj.drop('c')

In [185]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [187]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [190]:
# With DataFrame, index values can be deleted from either axis
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio','Colorado','Utah','New York'], columns = ['one','two','three','four'])

In [192]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [199]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0)
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [201]:
data.drop(['Colorado','Ohio'], axis = 0)

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [203]:
# We acn drop values from columns by passing axis = 1 or axis = 'columns'
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [205]:
data.drop(['two','four'], axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [209]:
# Many functions, like drop, which modify the size or shape of a Series or DataFrame, can manipulate an object in-place without returning a new object
obj.drop('e', inplace = True)

In [210]:
obj

a    0.0
b    1.0
d    3.0
dtype: float64